Revit 2024 API
ViewFamilyType.PlanViewDirection Property
 The PlanViewDirection of this view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public PlanViewDirection PlanViewDirection { get; set; }
Visual Basic
Public Property PlanViewDirection As PlanViewDirection
	Get
	Set
Visual C++
public:
property PlanViewDirection PlanViewDirection {
	PlanViewDirection get ();
	void set (PlanViewDirection value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: PlanViewDirection cannot be set to Undefined
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: View must be a Structural Plan
See Also
ViewFamilyType Class
Autodesk.Revit.DB Namespace